Repository: ztang1253/ZTBusService
Catalog: ZTBusService/App_GlobalResources/ZTTranslations.*.resx
Languages: fr

source: About
fr: Sur

# address
source: Street Address
fr: Adresse de rue

source: Change Language
fr: Changer de langue

source: City
fr: Ville

# Contact
source: Contact Us
fr: Contactez nous

source: Country Code
fr: Code postal

source: Create
fr: Créer

# CreateNewX
source: Create New {0}
fr: Créer un nouveau {0}

source: Date Hired
fr: Date d'embauche

source: Driver
fr: Conducteur

# driverLowerCase
source: driver
fr: conducteur

# exceptionTryingToAddX
source: exception trying to add new {0}:
fr: exception essayer d'ajouter un nouveau {0}:

# FieldMustBeDate
source: field '{0}' must be a date
fr: champ '{0}' doit être une date

# FieldMustBeNumeric
source: field '{0}' must be a number
fr: champ '{0}' doit être un nombre

source: First Name
fr: Prénom

# fullNameDriver
source: Driver Name
fr: Nom du pilote

source: Home
fr: Accueil

source: Home Phone
fr: Téléphone fixe

# id
source: Driver Id
fr: Id Pilote

source: Last Name
fr: Nom de famille

source: Log in
fr: S'identifier

source: Name
fr: Nom

# NewXRecordAdded
source: New {0} record added.
fr: New {0} enregistrement ajouté.

source: Phone
fr: Téléphone

source: Phone Pattern
fr: Motif de téléphone

source: --- Please select ---
fr: --- Veuillez choisir ---

source: Postal Code
fr: Code Postal

source: Postal Pattern
fr: Motif postal

# PropertyValueInvalid
source: '{0}' is not a valid value for '{1}'
fr: '{0}' est pas une valeur valide pour '{1}'

# PropertyValueRequired
source: a value is required for '{0}'
fr: une valeur est nécessaire pour '{0}'

# provinceStateLabel
source: Province Label
fr: Province Étiquette

source: Register
fr: registre

# Required
source: {0} cannot be empty or just spaces
fr: {0} ne peut pas être vides ou seulement

source: Return to List
fr: Retour à la liste

source: Roles
fr: Les rôles

source: Street
fr: rue

source: Street Address
fr: Adresse de rue

# TempMessageDeleteSuccessIdName
source: The driver (id: {0}, full name: {1}) has been deleted.
fr: Le pilote (id: {0}, le nom complet: {1}) a été supprimé.

# TempMessageErrorOnDeleteIdName
source: Fail to delete the driver (id: {0}, full name: {1}) :
fr: Défaut de supprimer le pilote (id: {0}, le nom complet: {1}):

# TempMessageErrorOnEditIdName
source: Fail to update information for the driver (id: {0}, full name: {1}) :
fr: Défaut de mettre à jour l'information pour le conducteur (id: {0}, le nom complet: {1}):

# TempMessageUpdateSuccessIdName
source: The information for this driver (id: {0}, full name: {1}) has been updated.
fr: Les données de ce pilote (id: {0}, le nom complet: {1}) a été mis à jour.

# TempMessageXisX
source: {0} is {1}.
fr: {0} est {1}.

# titleAddNewX
source: Add New {0}
fr: Ajouter un nouveau {0}

source: User Name
fr: Nom d'utilisateur

source: Users
fr: Utilisateurs

source: Work Phone
fr: Téléphone de travail

# XCannotBeBlanks
source: {0} cannot be just blanks/spaces.
fr: {0} ne peut pas être seulement des flans / espaces.

# XcannotBeDerivedFromXorX
source: {0} cannot be derived from {1} or {2}
fr: {0} ne peut pas être extraite de {1} ou {2}

# XCannotBeFuture
source: {0} cannot be in the future.
fr: {0} ne peut pas être dans l'avenir.

# XIsInvalidDate
source: {0} is not a valid date formate : 2005-12-31
fr: {0} est pas une date formate valide: 2005-12-31

# XIsInvalidPhoneNumber
source: {0} is not a valid phone number. Please format like 222-222-2222.
fr: {0} est pas un numéro de téléphone valide. S'il vous plaît formater comme 222-222-2222.

# XIsInvalidPostal
source: {0} is not a valid Canadian postal pattern: A3A 3A3
fr: {0} est pas un modèle postal canadien valide: A3A 3A3

# XisNotOnFile
source: {0} '{1}' is not on file
fr: {0} '{1}' est pas dans le dossier

# XRecordCreated
source: {0} record created
fr: {0} enregistrement créé

# ZhenzhenBusService
source: Zhenzhen's Bus Service
fr: Service Bus de Zhenzhen

# ErrorOnValidatingX
source: Error on validating {0} :
fr: Erreur sur la validation {0}:

# WrongProvincePattern
source: Province Code is not a valid Canadian province code.
fr: Province Code est pas un code de province canadienne valide.

# XCanOnlyBe2EnglishLetters
source: {0} should only contain English alphabet letters and be only 2 letters long.
fr: {0} ne doit contenir Anglais alphabet lettres et d'être seulement 2 lettres.

# DataTypeDateTime
source: The field {0} must be a date.
fr: Le champ {0} doit être une date.

# StringLength
source: The length of {0} should be from 2 to 50.
fr: La longueur de {0} devrait être de 2 à 50.
